           10  CUST-ID             PIC 9(9).
           10  CUST-NAME           PIC X(20).
           10  CUST-STATUS         PIC X.        *> A=Active, I=Inactive
           10  CUST-PLAN           PIC X(3).
           10  CUST-CYCLE          PIC 9(2).      *> 01..12
           10  FILLER              PIC X(85).
