           10  REJ-REASON          PIC X(4).      *> R01,R02,...
           10  REJ-SOURCE          PIC X(4).      *> TXN or CUST
           10  REJ-CUST-ID         PIC 9(9).
           10  REJ-DETAIL          PIC X(80).
           10  FILLER              PIC X(23).
           