           10  SRT-CUST-ID         PIC 9(9).
           10  SRT-DATE            PIC 9(8).
           10  SRT-TYPE            PIC X(2).
           10  SRT-AMOUNT          PIC 9(7)V99.
           10  SRT-DESC            PIC X(20).
           10  FILLER              PIC X(81).
